app/controllers/gymnasia_controller.rb

SELECT "timeslots".* FROM "timeslots"
---
  def show
    gyms = Gymnasium.all
    timeslots = Timeslot.all